Catalogs/КлассификаторыФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КлассификаторыФедеральныхМедрегистров</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПубликации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭлементов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Иерархия</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изменен</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураСправочника</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяПоля</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/ХарактеристикиОбъектовДляФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ХарактеристикиОбъектовДляФедеральныхМедрегистров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлементыКлассификаторовФедеральныхМедрегистров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УченыеСтепени</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыПрофессиональнойПодготовки</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрофессиональныеСтандарты</v8:Type>
						<v8:Type>cfg:EnumRef.СостоянияСотрудника</v8:Type>
						<v8:Type>cfg:EnumRef.ОтношениеКВоинскойОбязанности</v8:Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСпециальностейПоОбразованию</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтраслиНауки</v8:Type>
						<v8:Type>cfg:CatalogRef.ШтатноеРасписание</v8:Type>
						<v8:Type>cfg:CatalogRef.Награды</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Начисления</v8:Type>
						<v8:Type>cfg:CatalogRef.РазрядыКатегорииДолжностей</v8:Type>
						<v8:Type>cfg:CatalogRef.ОснованияУвольнения</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:ChartOfCalculationTypesRef.Удержания</v8:Type>
						<v8:Type>cfg:EnumRef.КатегорииДолжностейДляСтатистическогоУчета</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыПроцедурАккредитацииСпециалистов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ОбразованиеФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыОбразованияФизическихЛиц</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыКадровыхСобытий</v8:Type>
						<v8:Type>cfg:EnumRef.ВидыЗанятости</v8:Type>
						<v8:Type>cfg:CatalogRef.УчебныеЗаведения</v8:Type>
						<v8:Type>cfg:CatalogRef.СостояниеВБраке</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Классификатор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторыФедеральныхМедрегистров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ЭлементыКлассификаторовФедеральныхМедрегистров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭлементыКлассификаторовФедеральныхМедрегистров</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КлассификаторыФедеральныхМедрегистров</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОписаниеЭлемента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Поле</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КлассификаторыФедеральныхМедрегистров/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

// Возвращает реквизиты справочника, которые образуют естественный ключ для элементов справочника.
//
// Возвращаемое значение:
//  Массив из Строка - имена реквизитов, образующих естественный ключ.
//
Функция ПоляЕстественногоКлюча() Экспорт
	Результат = Новый Массив;
	Результат.Добавить("Код");
	Возврат Результат;
КонецФункции

// Конец ТехнологияСервиса.ВыгрузкаЗагрузкаДанных

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗагрузкаКлассификаторовМедРегистра

// Функция строит дерево значений из таблицы значений.
// Передаваемые параметры:
// ИсходнаяТаблица - таблица, которую следует преобразовать в дерево.
// 	* КолонкаID - строка - наименование колонки-идентификатора.
// 	* КолонкаParent - строка - наименование колонки-родителя.
// Возвращаемое значение
//   Дерево значений.
//
Функция ДеревоИзТаблицы(ИсходнаяТаблица, КолонкаID = "ID", КолонкаParent = "Parent")
	
	ИсходнаяТаблица.Колонки.Добавить("ПолеСортировки", Новый ОписаниеТипов("Строка", , Новый КвалификаторыСтроки(10)));
	Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл
		СтрокаТаблицы.ПолеСортировки = Прав("00000" + СокрЛП(СтрокаТаблицы[КолонкаParent]), 5);
	КонецЦикла;
	
	ИсходнаяТаблица.Сортировать("ПолеСортировки Возр");
	ДеревоРезультатов = Новый ДеревоЗначений; 
	Для Каждого Колонка Из ИсходнаяТаблица.Колонки Цикл
		Если Колонка.Имя = КолонкаParent Тогда
			Продолжить;
		КонецЕсли;
		ДеревоРезультатов.Колонки.Добавить(Колонка.Имя, Колонка.ТипЗначения);	
	КонецЦикла;
	
	Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл
		
		СтрокаРодитель = ДеревоРезультатов.Строки.Найти(СтрокаТаблицы[КолонкаParent], КолонкаID, Истина);
		Если СтрокаРодитель = Неопределено Тогда
			СтрокаДерева = ДеревоРезультатов.Строки.Добавить();
		Иначе
			СтрокаДерева = СтрокаРодитель.Строки.Добавить();
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблицы);

	КонецЦикла;
	
	// Еще раз пробежаться по таблице в ситуации когда Код родителя > кода элемента
	// тогда возможна ситуация с потерянными строками.
	Для Каждого СтрокаТаблицы Из ИсходнаяТаблица Цикл
		
		СтрокаРодитель = ДеревоРезультатов.Строки.Найти(СтрокаТаблицы[КолонкаParent], КолонкаID, Истина);
		СтрокаДерева    = ДеревоРезультатов.Строки.Найти(СтрокаТаблицы[КолонкаID], КолонкаID, Истина);
		
		Если СтрокаДерева = Неопределено Тогда
			
			СтрокаДерева = ДеревоРезультатов.Строки.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДерева, СтрокаТаблицы);
			
		КонецЕсли; 
		
		Если Не СтрокаДерева.Родитель = СтрокаРодитель Тогда
			ЗаполнитьЗначенияСвойств(СтрокаРодитель.Строки.Добавить(), СтрокаТаблицы);
			ДеревоРезультатов.Строки.Удалить(СтрокаДерева);
		КонецЕсли;
		
	КонецЦикла;
	
   Возврат ДеревоРезультатов;
   
КонецФункции

// Возвращает ссылку на элемент справочника.
//
Функция СохранитьЭлементСправочникЭлементыКлассификаторовМедРегистра(Данные, Владелец, Родитель, ЭтоГруппа)
	
	Если Данные.Наименование = Данные.НаименованиеЭлементаСправочника И ЗначениеЗаполнено(Данные.Ссылка) Тогда
		Возврат Данные.Ссылка;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Ссылка) Тогда
		ОбъектСправочника = Данные.Ссылка.ПолучитьОбъект();
	ИначеЕсли ЭтоГруппа Тогда
		ОбъектСправочника = Справочники.ЭлементыКлассификаторовМедРегистра.СоздатьГруппу();
	Иначе
		ОбъектСправочника = Справочники.ЭлементыКлассификаторовМедРегистра.СоздатьЭлемент();
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбъектСправочника, Данные, "Код,Наименование");
	ОбъектСправочника.Родитель = Родитель;
	ОбъектСправочника.Владелец = Владелец;
	ОбъектСправочника.ОбменДанными.Загрузка = Истина;
	ОбъектСправочника.Записать();
	
	Возврат ОбъектСправочника.Ссылка;
	
КонецФункции

Процедура СохранитьИерархическиеДанныеСправочникЭлементыКлассификаторовМедРегистра(КоллекцияДанных, Владелец, Родитель)
	Для Каждого СтрокаДанных Из КоллекцияДанных Цикл
		ПодчиненныеСтроки = СтрокаДанных.Строки;
		ЭтоГруппа = ПодчиненныеСтроки.Количество() > 0;
		Ссылка = СохранитьЭлементСправочникЭлементыКлассификаторовМедРегистра(СтрокаДанных, Владелец, Родитель, ЭтоГруппа);
		Если ЭтоГруппа Тогда
			СохранитьИерархическиеДанныеСправочникЭлементыКлассификаторовМедРегистра(ПодчиненныеСтроки, Владелец, Ссылка);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция ЭлементПоКоду(КодКлассификатора) Экспорт
	
	Возврат НайтиПоКоду(КодКлассификатора);
	
КонецФункции

Процедура ДлительнаяОперацияЗагрузкиКлассификаторов(Параметры, АдресХранилища) Экспорт
	
	КлассификаторыДляЗагрузки = Параметры.КлассификаторыДляЗагрузки;
	УИНОрганизации = Параметры.УИНОрганизации; 
	ЗагружатьИз1СФНСИ = Параметры.ЗагружатьИз1СФНСИ;
	Если ЗагружатьИз1СФНСИ Тогда 
		ВладелецТикета = Медицина.ВладелецТикета1СФНСИ();
		РезультатПолученияТикета = Медицина.ПолучитьТикетИПП(ВладелецТикета);
		Если РезультатПолученияТикета.Тикет <> Неопределено Тогда
			Токен = РезультатПолученияТикета.Тикет;
		Иначе
			ПоместитьВоВременноеХранилище(Ложь, АдресХранилища);
			ВызватьИсключение РезультатПолученияТикета.Ошибка;
		КонецЕсли;
	Иначе 
		Токен = Параметры.Токен;
	КонецЕсли;	
	
	HTTPСоединение = СоздатьСоединениеССервисомНСИФРМР(ЗагружатьИз1СФНСИ);
	АктуализироватьОписаниеСправочниковФРМР(КлассификаторыДляЗагрузки, HTTPСоединение, Токен, ЗагружатьИз1СФНСИ);
	ОбновитьСодержимоеСправочниковФРМР(КлассификаторыДляЗагрузки, HTTPСоединение, Токен, УИНОрганизации, ЗагружатьИз1СФНСИ);
	
	КодыКлассификаторов = КлассификаторыДляЗагрузки.ВыгрузитьКолонку("КодКлассификатора");
	РегистрыСведений.ХарактеристикиОбъектовДляФедеральныхМедрегистров.УстановитьХарактеристикиОбъектовПоКодамКлассификаторов(КодыКлассификаторов);
	
	ПоместитьВоВременноеХранилище(Истина, АдресХранилища);
	
КонецПроцедуры

Процедура АктуализироватьОписаниеСправочниковФРМР(СправочникиФРМР, HTTPСоединение, Токен, ЗагружатьИз1СФНСИ = Ложь)
	
	Для Каждого СправочникФРМР Из СправочникиФРМР Цикл
		СправочникФРМР.ОписаниеСправочника = ПолучитьПаспортСправочника(HTTPСоединение, Токен, СправочникФРМР.КодКлассификатора, ЗагружатьИз1СФНСИ);
		СправочникФРМР.Ссылка = ОбновитьСправочникФРМР(СправочникФРМР.Ссылка, СправочникФРМР.ОписаниеСправочника);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбновитьСодержимоеСправочниковФРМР(СправочникиФРМР, HTTPСоединение, Токен, УИДОрганизации, ЗагружатьИз1СФНСИ = Ложь)
	
	Для Каждого СправочникФРМР Из СправочникиФРМР Цикл
		СодержимоеСправочника = ПолучитьСодержимоеСправочника(HTTPСоединение, Токен, СправочникФРМР.Ссылка, УИДОрганизации, ЗагружатьИз1СФНСИ);
		Если СодержимоеСправочника <> Неопределено Тогда
			СохранитьДанныеВСправочникЭлементыСправочниковФРМР(СодержимоеСправочника, СправочникФРМР.Ссылка, УИДОрганизации);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьСоединениеССервисомНСИФРМР(ЗагружатьИз1СФНСИ = Ложь)
	
	ПротоколЗащиты = Новый ЗащищенноеСоединениеOpenSSL;
	Таймаут = 360;
	Если ЗагружатьИз1СФНСИ Тогда 
		Хост = "fnsi.med.1c.ru/rest";     
	Иначе
		Хост = "nsi.rosminzdrav.ru/port/rest";     
	КонецЕсли;
	ИнтернетПрокси = Неопределено;
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПолучениеФайловИзИнтернета") Тогда
		МодульПолучениеФайловИзИнтернета = ОбщегоНазначения.ОбщийМодуль("ПолучениеФайловИзИнтернета");
		ИнтернетПрокси = МодульПолучениеФайловИзИнтернета.ПолучитьПрокси("https");
	КонецЕсли;
	
	Соединение = Новый HTTPСоединение(Хост, , , , ИнтернетПрокси, Таймаут, ПротоколЗащиты);

	Возврат Соединение;
	
КонецФункции

Функция ВыполнитьЗапросHTTP(HTTPСоединение, АдресРесурса)

	Заголовки = Новый Соответствие();
	Заголовки.Вставить("Content-Type", "application/json");
	ЗапросHTTP = Новый HTTPЗапрос( АдресРесурса, Заголовки);

	ОтветHTTP = HTTPСоединение.ВызватьHTTPМетод("GET", ЗапросHTTP);
	СтруктураОтвета = Новый Структура("КодСостояния,ОтветСервера,ОтветСервераНеРасшифрованный,СообщениеОбОшибке");
	СтруктураОтвета.КодСостояния = ОтветHTTP.КодСостояния;
	
	Если ОтветHTTP.КодСостояния<400 Тогда 
		Попытка
			ОтветСервера = ОтветHTTP.ПолучитьТелоКакСтроку("UTF-8");
			ЧтениеJSON = Новый ЧтениеJSON;
			ЧтениеJSON.УстановитьСтроку(ОтветСервера);
			ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
			РезультатЗапроса = ДанныеJSON.Получить("result");
			Если РезультатЗапроса=Неопределено Тогда 
				СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Неверный формат ответа сервиса: '") + ОтветСервера;
			Иначе 
				Если РезультатЗапроса="ERROR" Тогда 
					СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка сервиса: '") + ОтветСервера;
				Иначе 
					СтруктураОтвета.ОтветСервера = ДанныеJSON;
					СтруктураОтвета.ОтветСервераНеРасшифрованный = ОтветСервера;
				КонецЕсли;
			КонецЕсли;
		Исключение
			СтруктураОтвета.СообщениеОбОшибке = ОписаниеОшибки();
		КонецПопытки;
	ИначеЕсли ОтветHTTP.КодСостояния=403 Тогда 
		СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка аутентификации (403 - Доступ запрещен).'");
	ИначеЕсли ОтветHTTP.КодСостояния=404 Тогда 
		СтруктураОтвета.СообщениеОбОшибке = НСтр("ru = 'Ошибка обращения к методу (404 - Страница не найдена).'");
	Иначе 
		Шаблон = НСтр("ru = 'Ошибка %1.'");
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(Шаблон, ОтветHTTP.КодСостояния);
		СтруктураОтвета.СообщениеОбОшибке = ТекстСообщения;
	КонецЕсли;
	
	Возврат СтруктураОтвета;
	
КонецФункции

Функция ВыполнитьЗапросREST(HTTPСоединение, ИмяМетода, Токен = Неопределено, IDСправочника = Неопределено, ДополнительныеПоля = Неопределено, ЗагружатьИз1СФНСИ = Ложь)
	
	Если ЗагружатьИз1СФНСИ Тогда 
		Если ЗначениеЗаполнено(IDСправочника) Тогда 
			ТекстЗапроса = ИмяМетода + ?(ЗначениеЗаполнено(Токен), "?ticket=" + Токен, "") + "&identifier=" + IDСправочника;
		Иначе 
			ВызватьИсключение "1С:ФНСИ. Идентификатор классификатора должен быть указан.";
		КонецЕсли;
	Иначе 
		ТекстЗапроса = ИмяМетода + ?(ЗначениеЗаполнено(Токен), "?userKey=" + Токен, "") + ?(ЗначениеЗаполнено(IDСправочника), "&identifier=" + IDСправочника, "");
	КонецЕсли;
	Если ДополнительныеПоля <> Неопределено Тогда
		Для Каждого ДополнительноеПоле Из ДополнительныеПоля Цикл
			ТекстЗапроса = ТекстЗапроса + "&" + ДополнительноеПоле.Ключ + "=" + ДополнительноеПоле.Значение;
		КонецЦикла;
	КонецЕсли;

	СтруктураОтвета = ВыполнитьЗапросHTTP(HTTPСоединение, ТекстЗапроса);

	Если СтруктураОтвета.СообщениеОбОшибке <> Неопределено Тогда
		ВызватьИсключение СтруктураОтвета.СообщениеОбОшибке;
	КонецЕсли;
	
	Возврат СтруктураОтвета.ОтветСервера;
	
КонецФункции

Функция ПолучитьПаспортСправочника(HTTPСоединение, Токен, IDСправочника, ЗагружатьИз1СФНСИ = Ложь)
	
	ОтветСервера = ВыполнитьЗапросREST(HTTPСоединение, "/passport", Токен, IDСправочника, , ЗагружатьИз1СФНСИ);
	
	Если ОтветСервера = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеСправочника = ПустаяСтруктураКлассификатораФРМР();
	Для Каждого ЭлементОписания Из ОписаниеСправочника Цикл
		ОписаниеСправочника[ЭлементОписания.Ключ] = ОтветСервера[ЭлементОписания.Ключ];
	КонецЦикла;
	ОписаниеСправочника.lastUpdate = СтроковыеФункцииКлиентСервер.СтрокаВДату(ОтветСервера["lastUpdate"]);
	publishDate = ОтветСервера.Получить("publishDate");
	Если publishDate = Неопределено Тогда 
		ОписаниеСправочника.publishDate = Дата('00010101');
	Иначе
		ОписаниеСправочника.publishDate = СтроковыеФункцииКлиентСервер.СтрокаВДату(publishDate);
	КонецЕсли;

	КлючевыеПоля = ОтветСервера["keys"];
	Для Каждого КлючевоеПоле Из КлючевыеПоля Цикл 
		Если ВРег(КлючевоеПоле["type"]) = "PRIMARY" Тогда 
			ОписаниеСправочника.fieldId = КлючевоеПоле["field"];
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ПустаяСтрока(ОписаниеСправочника.fieldId) Тогда 
		ТекстИсключения = СтрШаблон(НСтр("ru = 'Не удалось определить имя поля идентификатора классификатора %1'"), IDСправочника);
		ВызватьИсключение ТекстИсключения; 
	КонецЕсли;
	
	ПоляСправочника = Новый Структура();
	Для Каждого ПоляСтруктурыСправочника Из ОтветСервера["fields"] Цикл
		ПоляСправочника.Вставить(ПоляСтруктурыСправочника["field"], ПоляСтруктурыСправочника["alias"]);
	КонецЦикла;
	
	ОписаниеСправочника.Вставить("fields", ПоляСправочника);
	
	Возврат ОписаниеСправочника;
	
КонецФункции

Функция ПолучитьСодержимоеСправочника(HTTPСоединение, Токен, СправочникСсылка, УИДОрганизации = "", ЗагружатьИз1СФНСИ = Ложь)
	
	РазмерПорции = 200;
	ДополнительныеПоля = Новый Структура();
	ДополнительныеПоля.Вставить("version", СправочникСсылка.Версия);
	Если Не (СправочникСсылка.СтруктураСправочника.Найти("mo_oid", "ИмяПоля") = Неопределено)
		И ЗначениеЗаполнено(УИДОрганизации) Тогда
		ДополнительныеПоля.Вставить("filters", "mo_oid|" + УИДОрганизации);
	КонецЕсли;
	ДополнительныеПоля.Вставить("page", 1);
	ДополнительныеПоля.Вставить("size", РазмерПорции); 
	Если ЗагружатьИз1СФНСИ Тогда 
		ДополнительныеПоля.Вставить("userKey ", Строка(Новый УникальныйИдентификатор));
	КонецЕсли;
	
	ПоляПредставлений = ВозможныеПоляПредставлений();
	ПоляРодитель = ВозможныеПоляРодитель();
	СодержимоеКлассификатора = ПустаяТаблицаСодержимогоКлассификатораФРМР();
	
	КоличествоСтраниц = Цел(СправочникСсылка.КоличествоЭлементов / РазмерПорции);
	Если СправочникСсылка.КоличествоЭлементов % РазмерПорции > 0 Тогда 
		КоличествоСтраниц = КоличествоСтраниц + 1;
	КонецЕсли;
	
	Для Страница = 1 По КоличествоСтраниц Цикл 
	
	    ДополнительныеПоля.page = Страница;
		ОтветСервера = ВыполнитьЗапросREST(HTTPСоединение,"/data", Токен, СправочникСсылка.Код, ДополнительныеПоля, ЗагружатьИз1СФНСИ);
		
		Если ОтветСервера = Неопределено Тогда
			Возврат Неопределено;
		КонецЕсли;
				
		ИмяПоляПредставления = Неопределено;
		ИмяПоляРодитель = Неопределено;
		
		Для Каждого СтрокаЭлемента Из ОтветСервера["list"] Цикл
			СтруктураЭлемента = Новый Структура();
			Для Каждого ОписаниеРеквизита Из СтрокаЭлемента Цикл
				СтруктураЭлемента.Вставить(ОписаниеРеквизита["column"], ОписаниеРеквизита["value"]);
				Если ИмяПоляПредставления = Неопределено Тогда
					Если ПоляПредставлений.Найти(ВРег(ОписаниеРеквизита["column"])) <> Неопределено Тогда
						ИмяПоляПредставления = ОписаниеРеквизита["column"];
					КонецЕсли;
				КонецЕсли;
				Если ИмяПоляРодитель = Неопределено Тогда
					Если ПоляРодитель.Найти(ВРег(ОписаниеРеквизита["column"])) <> Неопределено Тогда
						ИмяПоляРодитель = ОписаниеРеквизита["column"];
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			
			СоставноеИмя = "";
			depart_name = "";
			hospital_name = "";
			ambulance_subdivision_name = "";
			lab_subdivision_name = "";
			Если СтруктураЭлемента.Свойство("depart_name", depart_name)
				И СтруктураЭлемента.Свойство("hospital_name", hospital_name)
				И СтруктураЭлемента.Свойство("ambulance_subdivision_name", ambulance_subdivision_name)
				И СтруктураЭлемента.Свойство("lab_subdivision_name", lab_subdivision_name) Тогда
				СоставноеИмя = depart_name;
				Если ЗначениеЗаполнено(hospital_name)
					И hospital_name <> depart_name Тогда
					СоставноеИмя = СоставноеИмя + " (" + hospital_name + ")";
				ИначеЕсли ЗначениеЗаполнено(ambulance_subdivision_name)
					И ambulance_subdivision_name <> depart_name Тогда
					СоставноеИмя = СоставноеИмя + " (" + ambulance_subdivision_name + ")";
				ИначеЕсли ЗначениеЗаполнено(lab_subdivision_name)
					И lab_subdivision_name <> depart_name Тогда
					СоставноеИмя = СоставноеИмя + " (" + lab_subdivision_name + ")";
				КонецЕсли;
			Иначе
				СоставноеИмя = СтруктураЭлемента[ИмяПоляПредставления];
			КонецЕсли;
			
			ЭлементКлассификатора = СодержимоеКлассификатора.Добавить();
			ЭлементКлассификатора.ID = СтруктураЭлемента[СправочникСсылка.ПолеИдентификатор];
			ЭлементКлассификатора.NAME = СоставноеИмя;
			ЭлементКлассификатора.PARENT_ID = ?(ЗначениеЗаполнено(ИмяПоляРодитель), СтруктураЭлемента[ИмяПоляРодитель], "");
			ЭлементКлассификатора.ITEMS = СтруктураЭлемента;
		КонецЦикла;
		
		Если ОтветСервера["total"] <= Страница * РазмерПорции Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Если СправочникСсылка.Код = "1.2.643.5.1.13.13.99.2.299" Тогда
		ЭлементКлассификатора = СодержимоеКлассификатора.Добавить();
		ЭлементКлассификатора.ID = "9008";
		ЭлементКлассификатора.NAME = "Образовательный";
		ЭлементКлассификатора.PARENT_ID = "";
		ЭлементКлассификатора.ITEMS = Новый Структура;
	КонецЕсли;
	
	Возврат СодержимоеКлассификатора;
	
КонецФункции

Процедура СохранитьИерархическиеДанныеСправочникЭлементыСправочниковФРМР(КоллекцияДанных, Владелец, Родитель)
	
	Для Каждого СтрокаДанных Из КоллекцияДанных Цикл
		
		ПодчиненныеСтроки = СтрокаДанных.Строки;
		ЭтоГруппа = ПодчиненныеСтроки.Количество()>0;
		
		Ссылка = СохранитьЭлементСправочникЭлементыСправочниковФРМР(СтрокаДанных, Владелец, Родитель, ЭтоГруппа);
		
		Если ЭтоГруппа Тогда
			
			СохранитьИерархическиеДанныеСправочникЭлементыСправочниковФРМР(ПодчиненныеСтроки, Владелец, Ссылка);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеИдентичны(Данные, ОбъектСправочника)
	
	Если Данные.Наименование <> Данные.НаименованиеЭлементаСправочника Тогда 
		Возврат Ложь;
	ИначеЕсли Данные.ОписаниеЭлемента.Количество() <> ОбъектСправочника.ОписаниеЭлемента.Количество() Тогда 
		Возврат Ложь;   
	Иначе 
		
		ОписаниеЭлементаИБ = Новый Структура;
		Для Каждого ЭлементИБ Из ОбъектСправочника.ОписаниеЭлемента Цикл
			ОписаниеЭлементаИБ.Вставить(ЭлементИБ.Поле, ЭлементИБ.Значение);
		КонецЦикла;
		
		Для Каждого ЭлементИБ Из ОписаниеЭлементаИБ Цикл
			ЗначениеФРМР = Неопределено;
			Если Данные.ОписаниеЭлемента.Свойство(ЭлементИБ.Ключ, ЗначениеФРМР) Тогда
				Если ЗначениеФРМР <> ЭлементИБ.Значение Тогда 
					Возврат Ложь; // В ФРМР другое значение элемента описания.
				КонецЕсли;
			Иначе 
				Возврат Ложь; // В ФРМР нет такого элемента описания.
			КонецЕсли;
		КонецЦикла; 
		
		Для Каждого ЭлементФРМР Из Данные.ОписаниеЭлемента Цикл 
			// Проверяем только ключи. Значения уже проверены выше.
			Если Не ОписаниеЭлементаИБ.Свойство(ЭлементФРМР.Ключ) Тогда
				Возврат Ложь; // В ИБ нет такого элемента описания.
			КонецЕсли;
		КонецЦикла;     
		
	КонецЕсли;
	
	Возврат Истина; 
	
КонецФункции

// Возвращает ссылку на элемент справочника.
//
Функция СохранитьЭлементСправочникЭлементыСправочниковФРМР(Данные, Владелец, Родитель, ЭтоГруппа)
	
	Если ЗначениеЗаполнено(Данные.Ссылка) Тогда
		ОбъектСправочника = Данные.Ссылка.ПолучитьОбъект();
		Если ДанныеИдентичны(Данные, ОбъектСправочника) Тогда
			Возврат Данные.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Данные.Ссылка) Тогда
		ОбъектСправочника = Данные.Ссылка.ПолучитьОбъект();
	ИначеЕсли ЭтоГруппа Тогда
		ОбъектСправочника = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.СоздатьГруппу();
	Иначе
		ОбъектСправочника = Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.СоздатьЭлемент();
	КонецЕсли;
	
	ОбъектСправочника.Код = Данные.Код;
	ОбъектСправочника.НаименованиеПолное = Данные.Наименование;
	ОбъектСправочника.Родитель = Родитель;
	ОбъектСправочника.Владелец = Владелец;
	
	ОбъектСправочника.ОписаниеЭлемента.Очистить();	
	Для Каждого ОписаниеЭлементаФРМР ИЗ Данные.ОписаниеЭлемента Цикл
		ОписаниеЭлемента = ОбъектСправочника.ОписаниеЭлемента.Добавить();
		ОписаниеЭлемента.Поле = ОписаниеЭлементаФРМР.Ключ;
		ОписаниеЭлемента.Значение = ОписаниеЭлементаФРМР.Значение;
	КонецЦикла;
		
	ОбъектСправочника.ОбменДанными.Загрузка = Истина;
	
	ОбъектСправочника.Записать();
	
	// Запишем ссылку вновь созданных элементов.
	// Это чтобы в конце проверить справочник на ссылки, не упомянутые в таблице полученных элементов классификатора, 
	// и пометить соответствующие элементы справочника на удаление. 
	Если Не ЗначениеЗаполнено(Данные.Ссылка) Тогда
		Данные.Ссылка = ОбъектСправочника.Ссылка;
	КонецЕсли;
	
	Возврат ОбъектСправочника.Ссылка;
	
КонецФункции

Функция ВозможныеПоляРодитель()
	
	ВариантыПолейРодитель = Новый Массив;
	ВариантыПолейРодитель.Добавить("PID");
	ВариантыПолейРодитель.Добавить("PARENT");
	ВариантыПолейРодитель.Добавить("PARENTID");
	ВариантыПолейРодитель.Добавить("ID_PARENT");
	ВариантыПолейРодитель.Добавить("PARENT_ID");
	ВариантыПолейРодитель.Добавить("PID_1002");
	
	Возврат ВариантыПолейРодитель;
	
КонецФункции

Функция ВозможныеПоляПредставлений()
	
	ВариантыПолейПредставления = Новый Массив;
	ВариантыПолейПредставления.Добавить("NAME");
	ВариантыПолейПредставления.Добавить("S_NAME");
	ВариантыПолейПредставления.Добавить("REGION");
	ВариантыПолейПредставления.Добавить("PROF_COURSE");
	ВариантыПолейПредставления.Добавить("SPECIALITY");
	ВариантыПолейПредставления.Добавить("ADDRESSTYPE");
	ВариантыПолейПредставления.Добавить("ENDTYPE");
	ВариантыПолейПредставления.Добавить("NAMEFULL");
	ВариантыПолейПредставления.Добавить("NAME_FULL");
	ВариантыПолейПредставления.Добавить("NAMESHORT");
	ВариантыПолейПредставления.Добавить("EDUCATIONKIND");
	ВариантыПолейПредставления.Добавить("WORK_POSITION");
	ВариантыПолейПредставления.Добавить("QUALIFICATION");
	ВариантыПолейПредставления.Добавить("PROFSTANDARD");
	ВариантыПолейПредставления.Добавить("EDUCATIONTYPE");
	ВариантыПолейПредставления.Добавить("ACCREDITATIONKIND");
	ВариантыПолейПредставления.Добавить("TEMPORARY_DERELICTION_REASON");
	ВариантыПолейПредставления.Добавить("SUBJECT");
	ВариантыПолейПредставления.Добавить("NAME_SHORT");
	ВариантыПолейПредставления.Добавить("TYPE_NAME");
	ВариантыПолейПредставления.Добавить("DEPART_NAME");
	ВариантыПолейПредставления.Добавить("REASON");
	ВариантыПолейПредставления.Добавить("FULL_NAME");
	ВариантыПолейПредставления.Добавить("BRIGADETYPE");
	ВариантыПолейПредставления.Добавить("BRIGADEPROFILE");
	ВариантыПолейПредставления.Добавить("BRIGADESPEC");
	ВариантыПолейПредставления.Добавить("AGENCYKIND");
	ВариантыПолейПредставления.Добавить("TERRITORYNAME");
	ВариантыПолейПредставления.Добавить("MOLEVEL");
	ВариантыПолейПредставления.Добавить("DEPARTTYPE");
	ВариантыПолейПредставления.Добавить("HOSPITALMODE");
	ВариантыПолейПредставления.Добавить("MARK_DESCRIPTION");
	ВариантыПолейПредставления.Добавить("SOURCE_FINANCIAL");
	ВариантыПолейПредставления.Добавить("NAME_1002");
	
//	ВариантыПолейПредставления.Добавить("WORK_POSITION");
	
	Возврат ВариантыПолейПредставления;
	
КонецФункции

Функция ОбновитьСправочникФРМР(Ссылка,ОписаниеСправочника) Экспорт 
	Если ОписаниеСправочника = Неопределено Тогда
		Возврат Справочники.КлассификаторыФедеральныхМедрегистров.ПустаяСсылка();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Ссылка) Тогда
		СправочникОбъект = Ссылка.ПолучитьОбъект();
	Иначе
		НайденноеОписаниеСправочника = Справочники.КлассификаторыФедеральныхМедрегистров.НайтиПоКоду(ОписаниеСправочника.oid);
		Если ЗначениеЗаполнено(НайденноеОписаниеСправочника) Тогда 
			СправочникОбъект = НайденноеОписаниеСправочника.ПолучитьОбъект();
		Иначе
			СправочникОбъект = Справочники.КлассификаторыФедеральныхМедрегистров.СоздатьЭлемент();
		КонецЕсли;
	КонецЕсли;
	
	СправочникОбъект.Наименование = ОписаниеСправочника.shortName;
	СправочникОбъект.Код 		= ОписаниеСправочника.oid;
	СправочникОбъект.Версия		= ОписаниеСправочника.version;
	СправочникОбъект.КоличествоЭлементов = ОписаниеСправочника.rowsCount;
	СправочникОбъект.Иерархия 	= ОписаниеСправочника.hierarchical;
	СправочникОбъект.Изменен 	= ?(ОписаниеСправочника.publishDate > ОписаниеСправочника.lastUpdate, 
									ОписаниеСправочника.publishDate, ОписаниеСправочника.lastUpdate);
	СправочникОбъект.ПолеИдентификатор = ОписаниеСправочника.fieldId;
	
	СправочникОбъект.СтруктураСправочника.Очистить();
	Для Каждого ПолеСправочника Из ОписаниеСправочника.fields Цикл
		ЭлементСтруктуры = СправочникОбъект.СтруктураСправочника.Добавить();
		ЭлементСтруктуры.ИмяПоля = ПолеСправочника.Ключ;
		ЭлементСтруктуры.Представление = ПолеСправочника.Значение;
	КонецЦикла;
	СправочникОбъект.ОбменДанными.Загрузка = Истина;
	СправочникОбъект.Записать();
	
	Возврат СправочникОбъект.Ссылка;
		
КонецФункции

Процедура СохранитьДанныеВСправочникЭлементыСправочниковФРМР(ТаблицаДанных, Владелец, УИДОрганизации)
	
	Запрос = Новый Запрос;
	ТекстЗапроса = "ВЫБРАТЬ
	               |	Таблица.ID КАК Код,
	               |	Таблица.Name КАК Наименование,
	               |	Таблица.Parent_ID КАК Родитель
	               |ПОМЕСТИТЬ ВТТаблица
	               |ИЗ
	               |	&ТЗ КАК Таблица
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Таблица.Код КАК Код,
	               |	Таблица.Наименование КАК Наименование,
	               |	Таблица.Родитель КАК Родитель,
	               |	Таблица.КоличествоПодчиненных КАК КоличествоПодчиненных,
	               |	ЕСТЬNULL(ЭлементыСправочника.Ссылка, ЗНАЧЕНИЕ(Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка)) КАК Ссылка,
	               |	ЕСТЬNULL(ЭлементыСправочника.НаименованиеПолное, """") КАК НаименованиеЭлементаСправочника
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		Таблица.Код КАК Код,
	               |		Таблица.Наименование КАК Наименование,
	               |		Таблица.Родитель КАК Родитель,
	               |		КОЛИЧЕСТВО(ТаблицаПодчиненных.Код) КАК КоличествоПодчиненных
	               |	ИЗ
	               |		ВТТаблица КАК Таблица
	               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТТаблица КАК ТаблицаПодчиненных
	               |			ПО Таблица.Код = ТаблицаПодчиненных.Родитель
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		Таблица.Код,
	               |		Таблица.Наименование,
	               |		Таблица.Родитель) КАК Таблица
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыСправочника
	               |		ПО (ЭлементыСправочника.Владелец = &Владелец)
	               |			И (ЭлементыСправочника.Код = Таблица.Код)";
	
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ТЗ", ТаблицаДанных);
	ТаблицаЭлементов = Запрос.Выполнить().Выгрузить();
	ТаблицаЭлементов.Колонки.Добавить("ОписаниеЭлемента", Новый ОписаниеТипов("Структура"));
	Для Каждого ЭлементТаблицы Из ТаблицаЭлементов Цикл
		ЭлементФРМР = ТаблицаДанных.Найти(ЭлементТаблицы.Код,"ID");
		ЭлементТаблицы.ОписаниеЭлемента = ЭлементФРМР.ITEMS;
	КонецЦикла;
	
	Если Владелец.Иерархия Тогда
		ДеревоЗначений = ДеревоИзТаблицы(ТаблицаЭлементов, "Код", "Родитель");
		СохранитьИерархическиеДанныеСправочникЭлементыСправочниковФРМР(ДеревоЗначений.Строки, Владелец, Справочники.ЭлементыКлассификаторовФедеральныхМедрегистров.ПустаяСсылка());
		ПометитьНаУдалениеЛишниеЭлементы(ДеревоЗначений.Строки, Истина, Владелец, УИДОрганизации);
	Иначе
		Для Каждого ЭлементТаблицы Из ТаблицаЭлементов Цикл
			СохранитьЭлементСправочникЭлементыСправочниковФРМР(ЭлементТаблицы, Владелец, Неопределено, Ложь);
		КонецЦикла;
		ПометитьНаУдалениеЛишниеЭлементы(ТаблицаЭлементов, Ложь, Владелец, УИДОрганизации);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПометитьНаУдалениеЛишниеЭлементы(ЭлементыФРМР, ЭтоДеревоЗначений, КлассификаторСсылка, УИДОрганизации)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭлементыКлассификаторов.Ссылка КАК Ссылка,
		|	ЭлементыКлассификаторов.ПометкаУдаления КАК ПометкаУдаления,
		|	ЕСТЬNULL(ОписаниеЭлементаКлассификатора.Значение, """") КАК УИДОрганизации
		|ИЗ
		|	Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров КАК ЭлементыКлассификаторов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЭлементыКлассификаторовФедеральныхМедрегистров.ОписаниеЭлемента КАК ОписаниеЭлементаКлассификатора
		|		ПО ЭлементыКлассификаторов.Ссылка = ОписаниеЭлементаКлассификатора.Ссылка
		|			И (ОписаниеЭлементаКлассификатора.Поле = ""mo_oid"")
		|ГДЕ
		|	ЭлементыКлассификаторов.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", КлассификаторСсылка);
	ЭлементыИБ = Запрос.Выполнить().Выгрузить();
	Для Каждого ЭлементИБ Из ЭлементыИБ Цикл 
		Если ПустаяСтрока(ЭлементИБ.УИДОрганизации) Или ЭлементИБ.УИДОрганизации = УИДОрганизации Тогда 
			Если ЭтоДеревоЗначений Тогда 
				ЭлементФРМР = ЭлементыФРМР.Найти(ЭлементИБ.Ссылка, "Ссылка", Истина);
			Иначе 
				ЭлементФРМР = ЭлементыФРМР.Найти(ЭлементИБ.Ссылка, "Ссылка");
			КонецЕсли;
			Если ЭлементФРМР = Неопределено И Не ЭлементИБ.ПометкаУдаления Тогда 
				ОбъектИБ = ЭлементИБ.Ссылка.ПолучитьОбъект();
				ОбъектИБ.ПометкаУдаления = Истина;
				ОбъектИБ.ОбменДанными.Загрузка = Истина;
				ОбъектИБ.Записать();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция ПустаяТаблицаСодержимогоКлассификатораФРМР()
	
	ТаблицаСправочникаФРМР = Новый ТаблицаЗначений();
	ТаблицаСправочникаФРМР.Колонки.Добавить("ID",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСправочникаФРМР.Колонки.Добавить("NAME",ОбщегоНазначения.ОписаниеТипаСтрока(500));
	ТаблицаСправочникаФРМР.Колонки.Добавить("PARENT_ID",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСправочникаФРМР.Колонки.Добавить("ITEMS", Новый ОписаниеТипов("Структура"));
	
	Возврат ТаблицаСправочникаФРМР;
	
КонецФункции

Функция ПустаяСтруктураКлассификатораФРМР()
	
	Результат = Новый Структура();
	Результат.Вставить("oid");
	Результат.Вставить("version");
	Результат.Вставить("rowsCount");
	Результат.Вставить("lastUpdate");
	Результат.Вставить("publishDate");
	Результат.Вставить("fullName");
	Результат.Вставить("shortName");
	Результат.Вставить("hierarchical");
	Результат.Вставить("fieldId");
	Результат.Вставить("fields");
	
	Возврат Результат;
	
КонецФункции

Функция ПустаяТаблицаСправочниковФРМР() Экспорт
	
	ТаблицаСправочниковФРМР = Новый ТаблицаЗначений();
	ТаблицаСправочниковФРМР.Колонки.Добавить("КодКлассификатора",ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаСправочниковФРМР.Колонки.Добавить("НаименованиеКлассификатора",ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаСправочниковФРМР.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.КлассификаторыФедеральныхМедрегистров"));
	ТаблицаСправочниковФРМР.Колонки.Добавить("ТипОбъектаМетаданных", ОбщегоНазначения.ОписаниеТипаСтрока(150));
	ТаблицаСправочниковФРМР.Колонки.Добавить("ЭлементыСопоставимы", Новый ОписаниеТипов("Булево"));
	ТаблицаСправочниковФРМР.Колонки.Добавить("ОписаниеСправочника");
	
	Возврат ТаблицаСправочниковФРМР;
	
КонецФункции

Функция ПолучитьСправочникиФРМРИзМакета() Экспорт
	
	ТекстовыйДокумент = Справочники.КлассификаторыФедеральныхМедрегистров.ПолучитьМакет("СправочникиНСИ");
	Таблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(ТекстовыйДокумент.ПолучитьТекст()).Данные;
	
	СправочникиФРМР = ПустаяТаблицаСправочниковФРМР();
	
	Для Каждого ОписаниеСправочника Из Таблица Цикл
		СправочникФРМР = СправочникиФРМР.Добавить();
		ЗаполнитьЗначенияСвойств(СправочникФРМР, ОписаниеСправочника);
		СправочникФРМР.ЭлементыСопоставимы = (ОписаниеСправочника.ЭлементыСопоставимы = "Истина");
	КонецЦикла;
	
	ЗаполнитьСсылкиНаСправочники(СправочникиФРМР);
	
	Возврат СправочникиФРМР;
	
КонецФункции

Процедура ЗаполнитьСсылкиНаСправочники(СправочникиФРМР) Экспорт
	
	Запрос = Новый Запрос();
	Запрос.УстановитьПараметр("Идентификаторы", СправочникиФРМР.ВыгрузитьКолонку("КодКлассификатора"));
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КлассификаторыФедеральныхМедрегистров.Ссылка КАК Ссылка,
	|	КлассификаторыФедеральныхМедрегистров.Код КАК Код
	|ИЗ
	|	Справочник.КлассификаторыФедеральныхМедрегистров КАК КлассификаторыФедеральныхМедрегистров
	|ГДЕ
	|	КлассификаторыФедеральныхМедрегистров.Код В(&Идентификаторы)
	|	И НЕ КлассификаторыФедеральныхМедрегистров.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОписаниеСправочникаФРМР = СправочникиФРМР.Найти(Выборка.Код, "КодКлассификатора");
		ОписаниеСправочникаФРМР.Ссылка = Выборка.Ссылка;
	КонецЦикла;
	
КонецПроцедуры

Функция ПолучитьОписаниеКлассификатораДолжностиМедицинскогоПерсоналаJSON() Экспорт 
	Макет = Справочники.КлассификаторыФедеральныхМедрегистров.ПолучитьМакет("ДолжностиМедицинскогоПерсоналаНСИ");
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Макет.ПолучитьТекст());
	ДанныеJSON = ПрочитатьJSON(ЧтениеJSON, Истина);
	Возврат ДанныеJSON;
КонецФункции

#КонецОбласти

// Определяет возможность выбора из классификатора групп и элементов.
//
// Параметры:
//   Классификатор - СправочникСсылка.КлассификаторыФедеральныхМедрегистров.
//
// Возвращаемое значение:
//   Булево - Истина, если классификатор входит в список классификаторов,
//   для которых использование групп и элементов разрешено.
//
Функция КлассификаторИспользуетВыборГруппИЭлементов(Классификатор) Экспорт
	
	МассивКлассификаторов = Новый Массив();
	Возврат МассивКлассификаторов.Найти(Классификатор) <> Неопределено;
	
КонецФункции

Процедура УстановитьОтборПоOIDОрганизации(Список, Организация) Экспорт
	
	НастройкиОрганизации = МедицинскиеРегистры.ПолучитьНастройкиОрганизации(Организация);
	ГруппаОтбора = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		Список.Отбор.Элементы,
		НСтр("ru = 'OID организации: '") + НастройкиОрганизации.ИдентификаторДляМедрегистров,
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ);
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ОписаниеЭлемента.Поле", "mo_oid");
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(ГруппаОтбора, "ОписаниеЭлемента.Значение", НастройкиОрганизации.ИдентификаторДляМедрегистров);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
